
// let string= "alloha" //строковой тип данных 
// //let не явное обьявление переменной
// //string имя переменной
// //= присвоение значения переменной
// //"alloha" значение переменной

// alert(string)

// let integer =10 //целое число
// console.log(integer) //вывод текста в консоль сайта

// let float =10.1 //число с точкой
// let booleen =true //False

// *********************************************************************************
// let num= prompt("Введите число для возведения в квадрат")
// //во внутрь пкеременной передаем функции promt
// //в браузер,потом в квадрат
//  num=num**2
//  //+ (num = num +1) знаяение увеличивается на 1
//  //возвели переменную num и ввели уу значение в квадрат(во вторую степень)
//  alert(num)//выводит значение на экран

// *********************************************************************************
// let num_First=Number(prompt("Введите первое число"))
// let num_Second = Number(prompt("Введите второе число"))

// let mid=(num_First + num_Second) / 2

// alert(mid)
// *********************************************************************************
// let num= Number(prompt("Введите число для возведения в квадрат"))
// num = num ** 2
// alert(num)
// *********************************************************************************